Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t
Serialization structure for Material Item Enumerator

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.MoreMaterialItemsLeft
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.IndexToStart
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.nMaterialItems
Number of the material items in the enumerator.

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.aMaterialItemNames
material names list.

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.aMaterialItemTypes
material types list.

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.ClientId
DO NOT USE! For internal usage only!